olonsoft/esp8266-Gill-anemometer/src/common.h
  if (strcmp("interval", command) == 0) {
    char *value = strtok(nullptr, "");
    if (value != nullptr) {
      appSettings.mqttTopicDataInterval = atoi(value);
      _mqttSendMessage("Saving new interval.");
      saveConfig();
    }
  }
}

#ifdef USE_PUBSUBCLIENT
void mqttCallback(char *topic, byte *payload, unsigned int length) {
  // handle message arrived
  _mqttOnMessage(topic, (char *)payload, length);
}
#else
void mqttCallback(String &topic, String &payload) {
  // handle message arrived
  _mqttOnMessage(const_cast<char *>(topic.c_str()),
                 const_cast<char *>(payload.c_str()), payload.length());
}
#endif

bool mqttConnect() {
  if (WiFi.status() != WL_CONNECTED) {
    TLOGDEBUGF_P(PSTR("%sNo WiFi connection \n"), MQTT_STR);
    return (_mqtt_connected = false);
  }
  TLOGDEBUGF_P(PSTR("%sConnecting to MQTT... \n"), MQTT_STR);
  _mqtt_connected = mqttClient.connected();
  if (!_mqtt_connected) {
    TLOGDEBUGF_P(PSTR("%sConnecting to: \n\t%s\n\tPort: %d\n\tUser: "
                       "%s\n\tpass: %s\n"), MQTT_STR,
                  appSettings.mqttBroker, appSettings.mqttPort,
                  appSettings.mqttUser, appSettings.mqttPass);
    String clientId = (char *)APP_NAME;
    clientId += "-" + helper_general::getChipIdHex();
#ifdef USE_PUBSUBCLIENT
    mqttClient.setServer(appSettings.mqttBroker, appSettings.mqttPort);
    mqttClient.setCallback(mqttCallback);
#else
    mqttClient.begin(appSettings.mqttBroker, appSettings.mqttPort, wifiClient);
    mqttClient.onMessage(mqttCallback);
#endif
    if (mqttClient.connect(clientId.c_str(), appSettings.mqttUser,
                           appSettings.mqttPass)) {
      _mqtt_connections++;
      TLOGDEBUGF_P(PSTR("%sConnected.\n"), MQTT_STR);
      String topic;
      topic = helper_general::addTrailingSlash(String(appSettings.mqttTopic)) + FPSTR(_topicCommand);
      mqttClient.subscribe(topic.c_str());
      _mqtt_connected = true;
    } else {
      int err = 0;
#ifdef USE_PUBSUBCLIENT
      err = mqttClient.state();
#else
      err = int(mqttClient.lastError());
#endif
      TLOGDEBUGF_P(PSTR("%sConnection failed] rc = %d\n"), MQTT_STR, err);
    }
  } else {
    TLOGDEBUGF_P(PSTR("%sAlready connected.\n"), MQTT_STR);
  }
  return _mqtt_connected;
}

bool _mqttSendMessage(const char *message) {
  bool result = false;
  if (mqttConnect()) {
    _status_text = "Sending...";
    String topic;
    topic = helper_general::addTrailingSlash(String(appSettings.mqttTopic)) + FPSTR(_topicStatus);
    LOGDEBUGLN(topic.c_str());
    result = (mqttClient.publish(topic.c_str(), message) == true);
    mqttClient.loop();
  }
  if (result) {
    TLOGDEBUGF_P(PSTR("%sSuccess sending message.\n"), MQTT_STR);
  } else {
    TLOGDEBUGF_P(PSTR("%sError sending message.\n"), MQTT_STR);
  }
  return result;
}

void _statusReport() {
  int v = analogRead(A0);
  float volt = map(v, 0, 1024, 0, 135) / 10.0f;
  char buffer[400] = {};
  snprintf_P(buffer, sizeof(buffer), _statusPayload, (char *)APP_NAME,
             (char *)APP_VERSION, WiFi.SSID().c_str(),
             "*****",  // WiFi.psk().c_str(),
             WiFi.BSSIDstr().c_str(), WiFi.RSSI(),
             helper_time::timeToString().c_str(), helper_time::getUpTimeString().c_str(),
             ESP.getFreeHeap(),
             String(ESP.getResetReason()).c_str(),
             String(appSettings.mqttBroker).c_str(), 
             appSettings.mqttPort,
             String(appSettings.mqttUser).c_str(),
             "*****",  // String(appSettings.mqttPass).c_str(),
             _mqtt_connections,
             volt);

  LOGDEBUGF("\n[MQTT BUFFER] %s\n", buffer);

  _mqttSendMessage(buffer);
}

void _statusReportLoop() {
  
  if (WiFi.status() != WL_CONNECTED) return;
  if (appSettings.mqttTopicStatusInterval == 0) return;

  static uint32_t last_status_check = 0;
  if (helper_time::TimeReached(last_status_check)) {
    helper_time::SetNextTimeInterval(last_status_check, appSettings.mqttTopicStatusInterval * 1000);
    _statusReport();
  }
    
}

void _mqttLoop() {
  if (WiFi.status() != WL_CONNECTED) return;

  if (!mqttClient.loop()) {
    static uint32_t last_mqtt_check = 0;

    if (helper_time::TimeReached(last_mqtt_check)) {
      helper_time::SetNextTimeInterval(last_mqtt_check, 10000);
      TLOGDEBUGF_P(PSTR("%s(mqttloop) Not connected. Reconnecting.\n"), MQTT_STR);
      mqttConnect();
    }

  } else {
    _statusReportLoop();
  }
}

#endif

void initialize() {
  // check file system
  TLOGDEBUGF_P(PSTR("[DEBUG] Checking file system.\n"));
  checkFileSystem();
  TLOGDEBUGF_P(PSTR("[DEBUG] Print default configuration:\n"));
  debugConfig();

  // loading configuration
  loadConfig();

#ifdef OLED1306
  initSSD1306();
#endif

  TLOGDEBUGF_P("[DEBUG] Printing info:\n"); 
  TLOGDEBUGLN(helper_general::getSystemInfoJson());

  TLOGDEBUGF_P("[DEBUG] Setup oneButton.\n");
  oneButtonSetup();

  // setup wifi
  TLOGDEBUGF_P("[DEBUG] Setup wifi.\n");
  jwSetup();

  // setup OTA updates
  TLOGDEBUGF_P("[DEBUG] Setup FOTA updater.\n");
  FOTA_Setup();

  // start time client
  // ! move it after wifi connection.
  TLOGDEBUGF_P("[DEBUG] Starting ntp client.\n");
  configTime(MY_TIMEZONE, ntpServer);  // updated for > 2.7.0
  //configTime(0, 0, ntpServer);
  //setenv("TZ", TZ_INFO, 1);
  //tzset();  // save the TZ variable
  
  // Give now a chance to the settimeofday callback,
  // because it is *always* deferred to the next yield()/loop()-call.
  yield();
}

void startWiFiManager() {
  TLOGDEBUGF_P("Starting wifi manager.\n");
  char buf[6];
  buf[0] = 0;
  WiFiManagerParameter custom_mqtt_broker("server", "mqtt server",
                                          appSettings.mqttBroker, 60);
  WiFiManagerParameter custom_mqtt_port("port", "mqtt port",
                                        itoa(appSettings.mqttPort, buf, 10), 6);
  WiFiManagerParameter custom_mqtt_user("user", "mqtt user",
                                        appSettings.mqttUser, 60);
  WiFiManagerParameter custom_mqtt_password("password", "mqtt password",
                                            appSettings.mqttPass, 60);
  WiFiManagerParameter custom_mqtt_topic("topic", "mqtt topic",
                                         appSettings.mqttTopic, 60);
  buf[0] = '\0';
  WiFiManagerParameter custom_mqtt_update("update", "update in secs",
      itoa(appSettings.mqttTopicDataInterval, buf, 10), 6);
  WiFiManager wifiManager;
  // wifiManager.resetSettings(); //reset settings - for testing
  // add all your parameters here
  wifiManager.addParameter(&custom_mqtt_broker);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_mqtt_user);
  wifiManager.addParameter(&custom_mqtt_password);
  wifiManager.addParameter(&custom_mqtt_topic);
  wifiManager.addParameter(&custom_mqtt_update);

